cliuxinxin/esp8266-ai/firmware/src/main.cpp
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS]; // top line (code + CJK name strip)
String stockLastVal[MAX_STOCKS];  // value line (price + pct)
unsigned long lastStockPollMs = 0;

// ---------- weather mode state ----------
const int WEATHER_MISSING = -32768;
struct WeatherDay {
  String label;
  int code = -1;
  int high = WEATHER_MISSING;
  int low = WEATHER_MISSING;
};
struct WeatherState {
  bool valid = false;
  bool stale = false;
  String city;
  int code = -1;
  int temperature = WEATHER_MISSING;
  int apparent = WEATHER_MISSING;
  int high = WEATHER_MISSING;
  int low = WEATHER_MISSING;
  int humidity = WEATHER_MISSING;
  int rain = WEATHER_MISSING;
  int windSpeed = WEATHER_MISSING;
  int aqi = WEATHER_MISSING;
  int textRev = -1;
  WeatherDay forecast[3];
  int forecastCount = 0;
};
WeatherState weather;
unsigned long lastWeatherPollMs = 0;
bool weatherChromeDrawn = false;
bool weatherDirty = false;
int weatherTextDrawnRev = -1;

// ---------- quote mode state ----------
// The bridge rasterizes the whole page because the firmware has no CJK font.
// Metadata is kept separately so AUTO can reject an unavailable HTTP transport
// before committing a scheduled window to this bitmap-only page.
struct QuoteState {
  bool valid = false;
  int textRev = -1;
  String language;
  long updatedAt = 0;
  bool stale = false;
};
QuoteState quote;
unsigned long lastQuotePollMs = 0;
bool quoteDirty = false;
bool quoteScreenDrawn = false;
QuoteBitmapFetchState quoteBitmapFetchState;
int quoteTextDrawnRev = -1;
// ---------- "NOW" (此刻) composite page state ----------
// The Mac rasterizes the whole 240x240 card (quote + weather + Codex quota)
// because the firmware has no CJK font and the page mixes three live sources.
// Same transport shape as the quote page: /now metadata carries a `rev` that
// bumps whenever any visible input changed; /now/text.raw is one 240x240
// RGB565 frame. The device refetches the bitmap only when the rev moves.
bool nowValid = false;
int nowRev = -1;               // last metadata rev (-1 = never received)
int nowLayoutRev = -1;         // bridge bitmap-layout revision
unsigned long lastNowPollMs = 0;
bool nowDirty = false;         // rev changed since last successful draw
bool nowScreenDrawn = false;   // a full frame is currently on screen
QuoteBitmapFetchState nowBitmapFetchState;
int nowDrawnRev = -1;          // rev of the frame currently on screen
int nowDrawnLayoutRev = -1;    // layout rev of the frame currently on screen
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

void applyBrightness() {
  // analogWriteRange(100) is set in setup(), so the duty value is just the
  // inverted percentage (active LOW: 0 duty = always LOW = full on).
  analogWrite(TFT_BL, 100 - brightness);
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

