cliuxinxin/esp8266-ai/firmware/src/main.cpp
int dotTextHeight(int pitch, int r) { return 6 * pitch + 2 * r + 1; }

// One glyph, (x, y) = top-left edge. r = dot radius (0 = single pixel).
void drawDotChar(char c, int x, int y, int pitch, int r, uint16_t color) {
  const DotGlyph *g = dotGlyph(c);
  if (!g) return;
  for (int ry = 0; ry < 7; ry++)
    for (int cx = 0; cx < g->w; cx++)
      if (g->rows[ry] & (1 << (g->w - 1 - cx))) {
        if (r <= 0) tft.drawPixel(x + r + cx * pitch, y + r + ry * pitch, color);
        else tft.fillCircle(x + r + cx * pitch, y + r + ry * pitch, r, color);
      }
}

void drawDotText(const String &s, int x, int y, int pitch, int r, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    drawDotChar(s[i], x, y, pitch, r, color);
    x += dotCharAdv(s[i], pitch, r);
  }
}

void drawDotTextC(const String &s, int cx, int y, int pitch, int r, uint16_t color) {
  drawDotText(s, cx - dotTextWidth(s, pitch, r) / 2, y, pitch, r, color);
}

void drawDotTextR(const String &s, int xRight, int y, int pitch, int r, uint16_t color) {
  drawDotText(s, xRight - dotTextWidth(s, pitch, r), y, pitch, r, color);
}

String dotFitText(String s, int maxPx, int pitch, int r) {
  if (dotTextWidth(s, pitch, r) <= maxPx) return s;
  while (s.length() > 0 && dotTextWidth(s + "..", pitch, r) > maxPx) s.remove(s.length() - 1);
  return s + "..";
}

// Square-dot variant on the same 5x7 glyphs: d x d filled squares. With
// d == pitch the strokes fuse solid - bold mini caps to pair with the dotted
// numerals (Nothing does the same: dotted digits, solid small labels).
int sqCharAdv(char c, int pitch, int d) {
  const DotGlyph *g = dotGlyph(c);
  int w = g ? g->w : 3;
  return (w - 1) * pitch + d + pitch;
}

int sqTextWidth(const String &s, int pitch, int d) {
  if (s.length() == 0) return 0;
  int w = 0;
  for (unsigned int i = 0; i < s.length(); i++) w += sqCharAdv(s[i], pitch, d);
  return w - pitch;
}

void drawSqText(const String &s, int x, int y, int pitch, int d, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    const DotGlyph *g = dotGlyph(s[i]);
    if (g)
      for (int ry = 0; ry < 7; ry++)
        for (int cx = 0; cx < g->w; cx++)
          if (g->rows[ry] & (1 << (g->w - 1 - cx)))
            tft.fillRect(x + cx * pitch, y + ry * pitch, d, d, color);
    x += sqCharAdv(s[i], pitch, d);
  }
}

void drawSqTextC(const String &s, int cx, int y, int pitch, int d, uint16_t color) {
  drawSqText(s, cx - sqTextWidth(s, pitch, d) / 2, y, pitch, d, color);
}

// Tiny-bold 3x5 caps (2x2 square dots): denser than the 5x7 face at the
// same height, used where a label must stay narrow but readable.
struct TinyGlyph {
  char c;
  uint8_t rows[5];
};

const TinyGlyph tinyGlyphs[] = {
    {'R', {0b110, 0b101, 0b110, 0b101, 0b101}},
    {'E', {0b111, 0b100, 0b110, 0b100, 0b111}},
    {'S', {0b011, 0b100, 0b010, 0b001, 0b110}},
    {'T', {0b111, 0b010, 0b010, 0b010, 0b010}},
};

void drawTinyBoldText(const String &s, int cx, int y, uint16_t color) {
  const int P = 2, D = 2;                                  // grid pitch / square dot size
  int x = cx - ((int)s.length() * (2 * P + D) + ((int)s.length() - 1) * 2) / 2;
  for (unsigned int i = 0; i < s.length(); i++) {
    for (const TinyGlyph &g : tinyGlyphs)
      if (g.c == s[i]) {
        for (int ry = 0; ry < 5; ry++)
          for (int gx = 0; gx < 3; gx++)
            if (g.rows[ry] & (0b100 >> gx)) tft.fillRect(x + gx * P, y + ry * P, D, D, color);
        break;
      }
    x += 2 * P + D + 2;
  }
}

void drawQuotaText(float hourPct, float weekPct, bool force, bool onlyPrimary = false) {
  bool single = onlyPrimary ? hourPct < 0 : (hourPct < 0 && weekPct >= 0);
  static int8_t lastSingle = -1;
  if ((int8_t)single != lastSingle) {
    lastSingle = (int8_t)single;
    force = true;
    tft.fillRect(0, QUOTA_LABEL_Y, 240, QUOTA_VALUE_Y + 22 - QUOTA_LABEL_Y, TFT_BLACK);
  }
  if (single) {
    if (force) drawSqTextC("周余", 120, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
    String v = remainingPctText(weekPct);
    if (force || v != lastQuotaWk) {
      lastQuotaWk = v;
      lastQuota5h = "";
      tft.fillRect(120 - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
      drawDotTextC(v, 120, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
    }
    return;
  }
  if (force) {
    drawSqTextC("5h", QUOTA_COL1_X, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
    drawSqTextC("周", QUOTA_COL2_X, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct);
  if (force || v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(QUOTA_COL1_X - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
    drawDotTextC(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
  }
  if (force || v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    tft.fillRect(QUOTA_COL2_X - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
    drawDotTextC(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
  }
}

// ---------- quota-exhausted countdown ----------
// When the active app window is exhausted, show countdown to that window reset.
// Codex now only uses weekly usage as its primary window; Claude keeps both 5h
// + weekly behavior.

enum CdType { CD_NONE, CD_5H, CD_WEEK };

float currentHourPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourPct : codexStatus.primaryPct;
}

int currentHourResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourResetMin : codexStatus.primaryResetMin;
}

float currentWeekPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayPct : codexStatus.weeklyPct;
}

int currentWeekResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayResetMin : codexStatus.weeklyResetMin;
}

CdType desiredCountdown() {
  if (currentApp == APP_CODEX) {
    if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
    return CD_NONE;
  }
  if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
  if (currentHourPct() >= 99.9f && currentHourResetMin() >= 0) return CD_5H;
  return CD_NONE;
}

CdType showingCd = CD_NONE; // what's on screen now (vs desiredCountdown())
String lastCountdown;

