cliuxinxin/esp8266-ai/firmware/src/main.cpp
// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

void readAutoEventSetting(JsonObject object, const char *key, AutoConfigField<bool> &target) {
  JsonVariant value = object[key];
  if (value.is<bool>()) target = AutoConfigField<bool>{true, value.as<bool>()};
}

void readAutoScheduledSetting(JsonObject object, const char *key, AutoScheduledConfigPatch &target) {
  JsonVariant value = object[key];
  if (!value.is<JsonObject>()) return;
  JsonObject setting = value.as<JsonObject>();
  if (setting["enabled"].is<bool>()) {
    target.enabled = AutoConfigField<bool>{true, setting["enabled"].as<bool>()};
  }
  if (setting["interval_seconds"].is<int>()) {
    target.intervalSeconds = AutoConfigField<int>{true, setting["interval_seconds"].as<int>()};
  }
  if (setting["duration_seconds"].is<int>()) {
    target.durationSeconds = AutoConfigField<int>{true, setting["duration_seconds"].as<int>()};
  }
}

// Rebuild from compiled defaults for each new revision. A missing or wrongly
// typed field therefore affects only that field, while a missing object from
// an older bridge leaves the currently active/default configuration intact.
void applyAutoDisplayConfig(JsonVariant value) {
  if (!value.is<JsonObject>()) return;
  JsonObject object = value.as<JsonObject>();
  if (!object["revision"].is<int>()) return;
  int revision = object["revision"].as<int>();
  if (revision == autoDisplayRuntime.revision) return;

  AutoDisplayConfigPatch patch;
  JsonVariant eventsValue = object["events"];
  if (eventsValue.is<JsonObject>()) {
    JsonObject events = eventsValue.as<JsonObject>();
    readAutoEventSetting(events, "claude", patch.claudeEnabled);
    readAutoEventSetting(events, "codex", patch.codexEnabled);
    readAutoEventSetting(events, "approval", patch.approvalEnabled);
    readAutoEventSetting(events, "music", patch.musicEnabled);
  }
  JsonVariant scheduledValue = object["scheduled"];
  if (scheduledValue.is<JsonObject>()) {
    JsonObject scheduled = scheduledValue.as<JsonObject>();
    readAutoScheduledSetting(scheduled, "weather", patch.scheduled[AUTO_SCHEDULED_WEATHER]);
    readAutoScheduledSetting(scheduled, "quote", patch.scheduled[AUTO_SCHEDULED_QUOTE]);
    readAutoScheduledSetting(scheduled, "stock", patch.scheduled[AUTO_SCHEDULED_STOCK]);
    readAutoScheduledSetting(scheduled, "net", patch.scheduled[AUTO_SCHEDULED_NET]);
  }

  applyAutoDisplayRevision(autoDisplayRuntime, revision, patch);
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  applyAutoDisplayConfig(doc["auto_display"]);
  return true;
}

uint8_t autoScheduledValidityMask() {
  uint8_t mask = 0;
  if (weather.valid) mask |= AUTO_DUE_WEATHER;
  if (quoteCanEnterMode()) mask |= AUTO_DUE_QUOTE;
  if (stockEverLoaded) mask |= AUTO_DUE_STOCK;
  if (netEverLoaded) mask |= AUTO_DUE_NET;
  return mask;
}

// The mode actually rendered. Fixed modes bypass this state machine. AUTO
// checks events first, then resumes any interrupted page, then fairly selects
// the oldest valid due page.
DisplayMode effectiveMode() {
  AutoTransitionInputs input;
  input.autoMode = displayMode == MODE_AUTO;
  input.nowMs = millis();
  input.approvalNeeded = claudeStatus.needsInput || codexStatus.needsInput;
  input.claudeWorking = claudeStatus.status == "working";
  input.codexWorking = codexStatus.status == "working";
  // The music page needs HTTP for its cover/text bitmaps, so wired-only mode
  // does not auto-promote it.
  input.musicPlaying = statusMusicPlaying && WiFi.status() == WL_CONNECTED;
  input.validMask = autoScheduledValidityMask();

