cliuxinxin/esp8266-ai/firmware/src/main.cpp
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("WiFi connected", 8, 70, 2);
    tft.drawString("Admin page:", 8, 100, 2);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.drawString("http://" + WiFi.localIP().toString(), 8, 125, 2);
    delay(3000);

    showMainUiIfNeeded();
    pollBridge();
  }
  // else: the config-portal screen stays up; either the user configures WiFi
  // (handled in loop) or serial #STATUS frames arrive and take the screen over
}

void loop() {
  wifiManager.process(); // keeps the config portal alive until WiFi is set up
  pumpSerial();          // wired (USB) bridge frames

  if (!webServerStarted && WiFi.status() == WL_CONNECTED) {
    // WiFi came up after boot (portal or slow AP); the portal has released
    // port 80 by now, so the admin server can bind it
    setupWebServer();
    webServerStarted = true;
    showMainUiIfNeeded();
    lastPollMs = 0; // poll the bridge right away
  }
  if (webServerStarted) webServer.handleClient();
  if (!mainUiShown) return; // config-portal screen is up, nothing to animate

  unsigned long nowMs = millis();

  // Weather and quote metadata stay warm in AUTO so scheduled windows never
  // have to wait for their JSON payloads after becoming due.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 &&
      (displayMode == MODE_AUTO || displayMode == MODE_WEATHER) &&
      (lastWeatherPollMs == 0 || nowMs - lastWeatherPollMs >= WEATHER_POLL_INTERVAL_MS)) {
    lastWeatherPollMs = nowMs;
    pollWeather();
  }
  QuoteMetadataPollInputs quotePollInputs;
  quotePollInputs.wifiConnected = WiFi.status() == WL_CONNECTED;
  quotePollInputs.bridgeConfigured = bridgeHost.length() > 0;
  quotePollInputs.modeNeedsQuote = displayMode == MODE_AUTO || displayMode == MODE_QUOTE;
  quotePollInputs.intervalElapsed =
      lastQuotePollMs == 0 || nowMs - lastQuotePollMs >= QUOTE_POLL_INTERVAL_MS;
  quotePollInputs.wiredActive = wiredActive();
  if (shouldPollQuoteMetadataHTTP(quotePollInputs, quoteBitmapFetchState, nowMs)) {
    lastQuotePollMs = nowMs;
    pollQuote();
  }
  // "NOW" is a manual/fixed page in v1 (not yet in the AUTO scheduler), so its
  // metadata is polled only while the mode is actually pinned to it.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 && displayMode == MODE_NOW &&
      (lastNowPollMs == 0 || nowMs - lastNowPollMs >= QUOTE_POLL_INTERVAL_MS)) {
    lastNowPollMs = nowMs;
    pollNow();
  }

  // Prime scheduled pages that do not arrive in /status. Once a first valid
  // payload is cached, their normal per-mode poll loops keep them fresh.
  if (WiFi.status() == WL_CONNECTED && bridgeHost.length() > 0 && displayMode == MODE_AUTO) {
    if (autoDisplayRuntime.config.scheduled[AUTO_SCHEDULED_STOCK].enabled && !stockEverLoaded &&
        (lastStockPollMs == 0 || nowMs - lastStockPollMs >= STOCK_POLL_INTERVAL_MS)) {
      lastStockPollMs = nowMs;
      pollStock();
    }
    if (autoDisplayRuntime.config.scheduled[AUTO_SCHEDULED_NET].enabled && !netEverLoaded &&
        (lastNetPollMs == 0 || nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS)) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  }

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  const bool bitmapPageEnter = (eff == MODE_QUOTE || eff == MODE_NOW) && lastEffectiveMode != eff;
  if (bitmapPageEnter) {
    const DisplayMode failedMode = eff;
    const bool drawn = eff == MODE_QUOTE ? drawQuoteScreen() : drawNowScreen();
    if (drawn) {
      scheduledModeBecameVisible(eff);
    } else {
      // The failed transfer starts a bounded retry delay. Re-run the scheduler
      // so AUTO can choose another due page (or a fixed page can keep showing
      // the pet), and repaint if a short body had overwritten some rows. Keep
      // lastEffectiveMode on the failed page so the != transition below fires.
      eff = effectiveMode();
      lastEffectiveMode = failedMode;
    }
  }
  if (eff != lastEffectiveMode) {
    if (lastEffectiveMode == MODE_QUOTE) quoteScreenDrawn = false;
    if (lastEffectiveMode == MODE_NOW) nowScreenDrawn = false;
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else if (eff == MODE_STOCK) {
      stockChromeDrawn = false;
      lastStockPollMs = 0;
    } else if (eff == MODE_WEATHER) {
      weatherChromeDrawn = false;
      lastWeatherPollMs = 0;
    } else if (eff == MODE_QUOTE) {
      lastQuotePollMs = 0;
    } else if (eff == MODE_NOW) {
      lastNowPollMs = 0;
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (netChromeDrawn) scheduledModeBecameVisible(MODE_NET);
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else if (eff == MODE_STOCK) {
    // stock watchlist: HTTP poll unless the serial link is pushing #STOCK
    if (nowMs - lastStockPollMs >= STOCK_POLL_INTERVAL_MS) {
      lastStockPollMs = nowMs;
      if (!wiredActive()) pollStock();
    }
    if (!stockChromeDrawn || stockDirty) drawStockScreen();
    if (stockChromeDrawn) scheduledModeBecameVisible(MODE_STOCK);
  } else if (eff == MODE_WEATHER) {
    if (!weatherChromeDrawn || weatherDirty) drawWeatherScreen();
    if (weatherChromeDrawn) scheduledModeBecameVisible(MODE_WEATHER);
  } else if (eff == MODE_QUOTE) {
    if ((!quoteScreenDrawn || quoteDirty || quoteTextDrawnRev != quote.textRev) &&
        !drawQuoteScreen()) {
      // effectiveMode() will leave quote while this revision is backed off.
    } else {
      scheduledModeBecameVisible(MODE_QUOTE);
    }
  } else if (eff == MODE_NOW) {
    const NowPageRevision drawn{nowDrawnRev, nowDrawnLayoutRev};
    const NowPageRevision current{nowRev, nowLayoutRev};
    if (!nowPageFrameIsCurrent(nowScreenDrawn, drawn, current, nowDirty) && !drawNowScreen()) {
      // effectiveMode() will leave now while this revision is backed off.
    } else {
      scheduledModeBecameVisible(MODE_NOW);
    }
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working" &&
                           (displayMode != MODE_AUTO || autoDisplayRuntime.config.claudeEnabled);
      bool codexWorking = codexStatus.status == "working" &&
                          (displayMode != MODE_AUTO || autoDisplayRuntime.config.codexEnabled);
      if (showingCd != CD_NONE) {
        // countdown owns the center area: no sprite frames over it
      } else if (currentApp == APP_CLAUDE && claudeWorking) {
        claudeFrame = (claudeFrame + 1) % claudeFrameCount();
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && codexWorking) {
        codexFrame = (codexFrame + 1) % codexFrameCount();
        drawCodexSprite(codexFrame);
      }
    }

    // countdown seconds tick locally between bridge polls
    static unsigned long lastCdTickMs = 0;
    if (showingCd != CD_NONE && nowMs - lastCdTickMs >= 1000) {
      lastCdTickMs = nowMs;
      drawCountdown(false);
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (bridgeStale()) {
        redrawRingOnly();
      } else if (currentAppNeedsInput()) {
        // approval needed: blink the whole border red, restore the quota ring
        // on the off-phase so it doesn't erase the normal chrome permanently
        if (flashOn) drawFullBorder(TFT_RED);
        else redrawRingOnly();
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // status poll continues in every mode (feeds /api/info and the web page).
  // Wired-first: while serial frames are flowing, skip the periodic /status
  // poll (works around AP client isolation, and avoids double updates).
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    if (!wiredActive()) pollBridge();
  }
}
